#!/usr/bin/python
# -*- coding: utf-8 -*-

import  os, sys, time

LIBRARY_DIR = r"/home/smirnov/pylib"    # Путь к рабочей директории (библиотеке)
sys.path.insert(0, LIBRARY_DIR)
import  dbtools
bases = {
        'contr': 'host=127.0.0.1 dbname=contracts port=5432 user=smirnov',
	'wtm':	'host=127.0.0.1 dbname=worktime port=5432 user=smirnov',
	}
cds_regnum = [		### Машины ЦДС от 09.06.2017
	'Н465МК', 'Н742НХ', 'Н969КВ', 'Н089ОМ', 'АТ708', 'АТ710', 'Н080ОМ', 'Н111ОА', 'Н121ОА', 'Н416ОР', 'Н377СВ',
	'М522ВО', 'Н401ОР', 'Н741ОМ', 'Н094ОМ', 'Н731АУ', 'Н420ОР', 'АЕ555', 'В052РК', 'М937АХ', 'М936АХ', 'М938АХ',
	'АС555', 'АМ555', 'АЕ888', 'АС888', 'М932АУ', 'М453ВМ', 'М452ВМ', 'М279ВС', 'М363РК', 'АС652', 'О059ВУ',
	'Н712КЕ', 'АС598', 'Н643ЕК', 'Н728КС', 'Н019СХ', 'Н735УМ', 'АС682', 'Н029РВ', 'Е568УВ', 'АС654', 'Н397ХК',
	'К169ОМ', 'К170ОМ', 'М701ЕЕ', 'М702ЕЕ', 'М703ЕЕ', 'К171ОМ', 'К168ОМ', 'К172ОМ', 'М704ЕЕ', 'Н241РЕ', 'Н123ОВ',
	'В609АА', 'В605АА', 'В620АА', 'Н464НР', 'В622АА', 'В604АА', 'М705ЕЕ', 'В984АЕ', 'В985АЕ', 'В986АЕ', 'В988АЕ',
	'В887АЕ', 'Н167РМ', 'Н174РМ', 'В412СУ', 'Н941ОМ', 'В421СУ', 'В418СУ', 'В422СУ', 'Н927ОМ', 'Н935ОМ', 'Н873НО',
	'В299ЕВ', 'В949НХ', 'А561УА', 'Е359КК', 'О732ВУ', 'Х729ХС', 'Н474КР', 'Е408ЕЕ', 'Е764МО', 'Н832ОН', 'А934ММ',
	'А095ТР', 'Н638НО', 'В261КВ', 'В988ЕВ', 'А631ТР', 'М856ВТ', 'Н623ХА', 'АС273', 'М855ВТ', 'Н420РХ', 'К850СН',
	'А240ТХ', 'Н568СХ', 'А440УН', 'Н563СХ', 'М385ЕВ', 'В237РН', 'В238РН', 'В239РН', 'В240РН', 'В241РН', 'В242РН',
	'В243РН', 'В244РН', 'В245РН', 'В246РН', 'В249РН', 'В250РН', 'В251РН', 'В252РН', 'В236РН', 'В253РН', 'В255РН',
	'М644ЕВ', 'М645ЕВ', 'М646ЕВ', 'М647ЕВ', 'М650ЕВ', 'М651ЕВ', 'М653ЕВ', 'М654ЕВ', 'М655ЕВ', 'М656ЕВ', 'М657ЕВ',
	'М658ЕВ', 'М659ЕВ', 'М660ЕВ', 'М649ЕВ', 'М642ЕВ', 'О917ВТ', 'О918ВТ', 'М894АК', 'М648ЕВ', 'М548ВТ', 'М556ВТ',
	'М557ВТ', 'М558ВТ', 'М559ВТ', 'М560ВТ', 'А851НН', 'А853НН', 'Е613ОЕ', 'А399УК', 'А588УН', 'В925КМ', 'А504ОА',
	'АО630', 'В976КМ', 'В978КМ', 'В625КМ', 'Т495ОС', 'А431УС', 'В924КМ', 'А849УН', 'В623КМ', 'А447МК', 'А921УВ',
	'В652КМ', 'М829ОС', 'М172ВВ', 'А517УА', 'К226ХН', 'К228ХН', 'К229ХН', 'К227ХН', 'К799ХН', 'К610ХН', 'К231ХН',
	'К230ХН', 'К207ХН', 'К933ХН', 'К934ХН', 'К935ХН', 'К936ХН', 'К937ХН', 'К938ХН', 'К940ХН', 'К941ХН', 'К942ХН',
	'К943ХН', 'Е716УМ', 'М728ЕУ', 'М616ЕВ', 'К165СМ', 'О636АХ', 'М729ЕУ', 'О641АХ', 'О055АХ', 'О124ОА', 'Н935УТ',
	'Н320ТВ', 'М730ЕУ', 'О422АХ', 'М870АК', 'М652ЕВ', 'О061АХ', 'Н398ОУ', 'Н934УТ', 'М331НВ', 'О958УА', 'Н035ВР',
	'К534ОА', 'М395СУ', 'М430АК', 'М452СМ', 'М431АК', 'АО618', 'М851ХХ', 'М368ХТ', 'В069КЕ', 'М861ХХ', 'К245ХВ',
	'М414НО', 'В921ХУ', 'В013АР', 'В015АР', 'В022АР', 'В021АР', 'В024АР', 'О945ЕВ', 'В019АР', 'В017АР', 'В014АР',
	'В016АР', 'Н755ТМ', 'В012АР', 'М296ВН', 'М297ВН', 'М298ВН', 'М299ВН', 'М501ЕТ', 'М502ЕТ', 'М504ЕТ', 'М529ЕТ',
	'М530ЕТ', 'М531ЕТ', 'М532ЕТ', 'М533ЕТ', 'М534ЕТ', 'М535ЕТ', 'М536ЕТ', 'М146ТР', 'М061АТ', 'М062АТ', 'К442УС',
	'Н211АС', 'М140ТР', 'К443УС', 'Н767ОЕ', 'М260ЕТ', 'К914ХВ', 'М357НЕ', 'М116ТР', 'Н787ТМ', 'Н218АС', 'Н864ЕР',
	'Н785ТМ', 'М257ЕТ', 'М265ЕТ', 'Н873РХ', 'Н855РХ', 'Н887ТМ', 'В511ЕО', 'Н841ТР', 'Н716ТР', 'Х961НУ', 'К230ЕР',
	'Н826РВ', 'Н895ТМ', 'В987КВ', 'Н838ТР', 'Н216РХ', 'АС657', 'АО128', 'АС659', 'АО125', 'Н545АЕ', 'АО127',
	'АС658', 'АО123', 'Н006СХ', 'О792ОС', 'Н344МК', 'Е401АК', 'Е446УО', 'А344ТС', 'Е445УО', 'А156УВ', 'А157УВ',
	'А159УВ', 'Е449УО', 'А543АУ', 'Е448УО', 'Е447УО', 'А160УВ', 'К566ЕК', 'К166ОМ', 'К073ХХ', 'М339ВН', 'М338ВН',
	'М337ВН', 'М217МН', 'М720ЕЕ', 'М220МН', 'М722ЕЕ', 'М207МН', 'М724ЕЕ', 'М012ЕТ', 'М013ЕТ', 'М014ЕТ', 'М017ЕТ',
	'М018ЕТ', 'М144ЕА', 'М148ЕА', 'М150ЕА', 'К214ОТ', 'К210ОТ', 'К924ХВ', 'К441УС', 'К206ОТ', 'К216ОТ', 'К923ХВ',
	'К913ХВ', 'К917ХВ', 'К915ХВ', 'К919ХВ', 'К947ТХ', 'К209ОТ', 'К916ХВ', 'К921ХВ', 'Н851РХ', 'К212ОТ', 'М364АС',
	'М365АС', 'М366АС', 'М367АС', 'М369АС', 'М370АС', 'М372АС', 'М374АС', 'М375АС', 'М486АС', 'В285ЕТ', 'Е334КН',
	'Е425ОМ', 'Е715УМ', 'Е714УМ', 'АС917', 'АС918', 'В255СН', 'АО616', 'Е709АЕ', 'АС332', 'АН293', 'М145ТК',
	'Е755АЕ', 'Х023ХТ', 'М334НН', 'Н330ЕВ', 'М163УВ', 'Н901ХЕ', 'К305ОТ', 'В920КУ', 'К658ОО', 'М440ВТ', 'М609ЕН',
	'К336АВ', 'А375МК', 'М263НВ', 'К450ХУ', 'М849СН', 'М414АХ', 'АС007', 'АС011', 'АС012', 'Н851ЕР', 'М261ЕТ',
	'Н856ЕР', 'Н819ЕТ', 'Н821ЕТ', 'Н857ЕР', 'Н859ЕР', 'АС771', 'Н583КТ', 'АС003', 'АС004', 'АС006', 'Н870ЕТ',
	'В675АО', 'АС009', 'АС013', 'АС815', 'АС816', 'АС817', 'АС772', 'Н928РХ', 'АС001', 'М544ВТ', 'М546ВТ',
	'М427МУ', 'М551ВТ', 'М554ВТ', 'М428МУ', 'М429МУ', 'М430МУ', 'М431МУ', 'М432МУ', 'М475ВХ', 'М317ВЕ', 'В247РН',
	'К421ХХ', 'В248РН', 'В606РЕ', 'М851АТ', 'В254РН', 'К699ХУ', 'К697ХУ', 'В603РЕ', 'В605РЕ', 'К277ХА', 'В607РЕ',
	'К172НХ', 'К349ОУ', 'К813ХС', 'В608РЕ', 'Е957МУ', 'В601РЕ', 'В599РЕ', 'В604РЕ', 'О502АА', 'В969КК', 'В610РЕ',
	'М801МХ', 'В600РЕ', 'К897ХР', 'В192ХК', 'АТ998', 'В735АР', 'М130ТК', 'К228ТН', 'М133ТК', 'Н179ОО', 'М140ТК',
	'Н259ОР', 'АТ994', 'АТ995', 'В311НО', 'АТ997', 'В310НО', 'В314НО', 'АУ026', 'АТ999', 'М497ОР', 'Н255ОР',
	'Н262ОР', 'В232МХ', 'М109ТР', 'М110ТР', 'Н834ЕТ', 'М105ТР', 'Н872ЕР', 'Н874ЕР', 'Н852РХ', 'М112ТР', 'Н855ЕР',
	'Н856РХ', 'М254ЕТ', 'М255ЕТ', 'М108ТР', 'М143ТР', 'М150ТР', 'К976ТВ', 'К977ТВ', 'К925ТВ', 'К923ТВ', 'К924ТВ',
	'К922ТВ', 'К921ТВ', 'К920ТВ', 'В177ХК', 'В602РЕ', 'АТ528', 'В598РЕ', 'В755АР', 'В469МЕ', 'Е086ХС', 'К116НВ',
	'К170ОР', 'А640АА', 'М454ОХ', 'Н341ЕВ', 'Н349ЕВ', 'Н676НК', 'М811ХС', 'В659РК', 'В402ВР', 'А538УХ', 'В432ОС',
	'А566УА', 'К344МХ', 'В803ЕК', 'К597МК', 'К905СО', 'К256ВЕ', 'В043ЕО', 'АР683', 'К335ЕК', 'В577АР', 'В918ОН',
	'В921ОН', 'В433ОС', 'Е019ЕА', 'В427ВА', 'А537УХ', 'В920ОН', 'М334ЕТ', 'М292МО', 'М626ОС', 'М673ВЕ', 'М187АМ',
	'М247ВН', 'М540АН', 'Н946ОР', 'М896ТМ', 'М273МК', 'М272МК', 'М440ЕХ', 'М674ВЕ', 'М821ЕЕ', 'М541АН', 'М499РВ',
	'М626АК', 'Н693СА', 'Н268ОН', 'Н366ТК', 'М319ЕХ', 'М469ОХ', 'Н868НО', 'Н153ОР', 'В375КН', 'Е756ЕА', 'К081ОС',
	'АК445', 'К243НК', 'К935НС', 'М510НР', 'К059УС', 'К107ВВ', 'М240ЕК', 'В925КН', 'Н559ЕХ', 'Н189СК', 'К939ОР',
	'М632МВ', 'М273ХН', 'Н445ОЕ', 'К037ХК', 'С357КА', 'М278МН', 'К083АВ', 'К047НР', 'К045НР', 'М167НА', 'К046НР',
	'М278ТМ', 'Е973РЕ', 'К632ОК', 'К652ОЕ', 'К865ОО', 'М221АР', 'К659ОЕ', 'М738НС',
	]

def	check_is_data (gosnums):
#	print "check_is_data"
	for gosnum in gosnums:
		print "\t", gosnum

def	main ():
	DB_cont = dbtools.dbtools (bases['contr'])
	not_never = []
	not_data = []
	not_ts = []
	dtm = 24*3600 * 10	# Days
	currtm = time.time() - dtm
	for sgn in cds_regnum:
		query = "SELECT id_ts, gosnum, (extract(epoch from last_date)), last_date FROM transports t LEFT JOIN atts a ON t.device_id = a.device_id WHERE id_org = 475 AND gosnum LIKE '%s%%'" % sgn
	#	query = "SELECT id_ts, gosnum FROM transports WHERE id_org = 475 AND gosnum LIKE '%s%%'" % sgn
		rows = DB_cont.get_rows(query)
		if not rows:
			not_ts.append (sgn)	#, query
			ddd = DB_cont.get_dict ("SELECT * FROM transports WHERE gosnum LIKE '%s%%'" % sgn)
			if ddd:
				for c in ddd.keys():
					if ddd[c]:
						print sgn, "\t", s, "=", ddd[c],
				print
		else:
			if rows[0][2] and rows[0][2] > currtm:
				print	"\t", rows[0][1], "\t", rows[0][3]
			elif not rows[0][2]:
				not_never.append (rows[0][1])
			else:
				not_data.append("%s\t %s" % (rows[0][1], str (rows[0][3])))
		'''	DEBUG
		elif len(rows) == 1:
			query = "UPDATE transports SET bm_ssys = 2048 WHERE id_ts = %d" % rows[0][0]
			print query, DB_cont.qexecute(query)
		else:
			print len(rows), rows
		'''
	if not_data:
		print "Нет данных от ТС:"
		check_is_data (not_data)
	if not_ts:
		print "ТС отсутствуют в РНИЦ:"
		check_is_data (not_ts)
	if not_never:
		print "Данные от ТС отсутствуют в РНИЦ:"
		check_is_data (not_never)
	
if __name__ == "__main__":
	print "Start:", sys.argv
	main()
